package ch07;

import java.util.concurrent.TimeUnit;

public class Ex21 {
	public static void main(String[] args) throws InterruptedException {
		int bmp,i;
		long start_clock, end_clock;
		float spend=0; // 小綠人已行走的時間(秒)

		// 使用2維字元陣列記錄10個圖案
		String[][] green_walker = new String[][] {
			// bmp:0 第1張靜止紅綠燈之小綠人
			{ "      111        ",
   			  "      111        ", 
   			  "      111        ", 
   			  "      1 1        ",
			  "     11111       ", 
			  "    1111111      ", 
			  "    1111111      ", 
			  "    1 111 1      ",
			  "    1 111 1      ", 
			  "    1 111 1      ", 
			  "    1111111      ", 
			  "     11111       ",						
			  "     11 11       ", 
			  "     11 11       ", 
			  "     11 11       ", 
			  "    111 111      " },

		    //bmp:1 第2張紅綠燈之小綠人
		    { "                 ",
		      "     11          ",
		      "    1111         ",
		      "     11          ",
		      "      11         ",
		      "      1111       ",
		      "      111 1      ",
		      "     1 11  1     ",
		      "    1  11  1     ",
		      "       111       ",
		      "       1 1       ",
		      "      1   111    ",
		      "      1      1   ",
		      "      1     1    ",
		      "    11           ",
		      "                 "}, 

		    //bmp:2 第3張紅綠燈之小綠人
		    { "                 ",
		      "    11           ",
		      "   1111          ",
		      "    11           ",
		      "     11          ",
		      "     111         ",
		      "     11 1        ",
		      "    1111 1       ",
		      "   1  11 1       ",
		      "      111        ",
		      "      1 1        ",
		      "     1   11      ",
		      "    1     1      ",
		      "     11  11      ",
		      "      1          ",
		      "    111          "},

 		    //bmp:3 第4張紅綠燈之小綠人 
		    { "                 ",
		      "     11          ",
		      "    1111         ",
		      "     11          ",
		      "      11         ",
		      "      111        ",
		      "      1111       ",
		      "      111 1      ",
		      "       11 1      ",
		      "       111       ",
		      "       1 1       ",
		      "      1   1      ",
		      "      1    1     ",
		      "      1     1    ",
		      "    111      1   ",
		      "            1    "},

		    //bmp:4 第5張紅綠燈之小綠人 
		    { "                 ",
		      "    11           ",
		      "   1111          ",
		      "    11           ",
		      "     11          ",
		      "     1111        ",
		      "     111 1       ",
		      "    1 11 1       ",
		      "   1  11         ",
		      "      111        ",
		      "      1 1        ",
		      "     1   11      ",
		      "     1     11    ",
		      "     1      1    ",
		      "   11      1     ",
		      "                 "},

		    //bmp:5 第6張紅綠燈之小綠人 
		    { "                 ",
		      "     11          ",
		      "    1111         ",
		      "     11          ",
		      "      11         ",
		      "      111        ",
		      "      111        ",
		      "      111        ",
		      "       11        ",
		      "       11        ",
		      "       11        ",
		      "       11        ",
		      "        1        ",
		      "        1        ",
		      "        1        ",
		      "      111        "}, 

		    //bmp:6 第7張紅綠燈之小綠人 
		    { "                 ",
		      "    11           ",
		      "   1111          ",
		      "    11           ",
		      "     11          ",
		      "     1111        ",
		      "     111 1       ",
		      "     111  1      ",
		      "    1 11         ",
		      "      111        ",
		      "      1 1        ",
		      "     1   111     ",
		      "     1      1    ",
		      "   111           ",
		      "                 ",
		      "                 "}, 

		    //bmp:7 第8張紅綠燈之小綠人 
		    { "                 ",
		      "     11          ",
		      "    1111         ",
		      "     11          ",
		      "      11         ",
		      "      111        ",
		      "      11 1       ",
		      "      1111       ",
		      "       111       ",
		      "       11        ",
		      "       11        ",
		      "      111        ",
		      "      1  1       ",
		      "       1  1      ",
		      "     111   1     ",
		      "                 "}, 

		    //bmp:8 第9張紅綠燈之小綠人 
		    { "                 ",
 		      "    11           ",
		      "   1111          ",
		      "    11           ",
		      "     11          ",
		      "     1111        ",
		      "     111 1       ",
		      "    1 11  1      ",
		      "   1  11  1      ",
		      "      11         ",
		      "      111        ",
		      "      1 1        ",
		      "     1   11      ",
		      "     1    11     ",
		      "     1     1     ",
		      "   11     1      "}, 

		    //bmp:9 第10 張紅綠燈之小綠人 
		    { "                 ",
		      "     11          ",
		      "    1111         ",
		      "     11          ",
		      "      11         ",
		      "      111        ",
		      "      11 1       ",
		      "     1111 1      ",
		      "    1  11 1      ",
		      "       111       ",
		      "       1 1       ",
		      "      1   1      ",
		      "     1     1     ",
		      "      11    1    ",
		      "       1   11    ",
		      "      11         "}     
		 };

		// 顯示第0張圖
			for (i = 0; i < 16; i++){
				System.out.print(green_walker[0][i]);
				System.out.println();
			}	

		start_clock = System.currentTimeMillis();
		// currentTimeMillis()靜態方法: 取得目前時間到1970/1/1 00:00:00間的毫秒數
		
		while (true) {
			for (bmp = 1; bmp <= 9; bmp++) {				
				// 顯示第bmp張圖
				for (i = 0; i < 16; i++){
					System.out.print(green_walker[bmp][i]);
					System.out.println();
				}

				end_clock = System.currentTimeMillis();
				// currentTimeMillis()靜態方法: 取得目前時間到1970/1/1 00:00:00間的毫秒數
				
				spend = (float) (end_clock - start_clock) / 1000;
				// 從小綠人開始執行到目前所經過的時間(秒)

				if (spend <= 30) // 慢走(第0~30秒),每0.65秒播一張圖案
					TimeUnit.MILLISECONDS.sleep(650);
				else if (spend <= 45) // 快走(第30~45秒),每0.325秒播一張圖案
					TimeUnit.MILLISECONDS.sleep(325);
				else if (spend <= 60) // 跑走(第45~60秒),每0.125秒播一張圖案
					TimeUnit.MILLISECONDS.sleep(125);
				else
					break;
			}
			if (spend >= 60) // 一分鐘後
				break;
		}
		
		// 顯示第0張圖
		System.out.println();
		for (i = 0; i < 16; i++){
			System.out.print(green_walker[0][i]);
			System.out.println();
		}		
	}
}
